/* Headings for text key bindings groups */
"Text Editing" = "Text Editing";
"Cursor Movement" = "Cursor Movement";
"Text Formatting" = "Text Formatting";
"Project Navigation" = "Project Navigation";
"Documentation Access" = "Documentation Access";
"File Operations" = "File Operations";
"Source Code Management" =  "Source Code Management";
"Debugging Operations" = "Debugging Operations";
"Workspace Display" = "Workspace Display";
"Application Actions" = "Application Actions";
"Special" = "Special";

/* User-readable versions of all actions that can be bound to keystrokes */

"nextItem:" = "Next Result";
"previousItem:" = "Previous Result";

"historyNext:" = "Next Selection";
"historyPrex:" = "Previous Selection";

"shortCircuit:" = "Add Argument";

"descend:" = "Show Children";
"altDescend:" = "Show Alternate Children";

"ascend:" = "Show Parent";
"altAscend:" = "Show Alternate Parent";
"trueAscend:" = "Show True Parent";


"setDefault:" = "Set Default";
"removeDefault:" = "Remove Default";


"sortByName:" = "Sort By Name";
"sortByScore:" = "Sort By Score";


"goHome:" = "Go Home";
"goRoot:" = "Go to Root";


"grabSelection:" = "Grab Selection";
"dropSelection:" = "Grab and Drop Selection";

/*
"#quote#" = "Quoted Insertion";
"#argument#" = "Repeat Count Prefix";
"#multi-key#" = "Multi-key Prefix";
"_cancelKey:" = "Cancel";
"complete:" = "Code Sense Complete";
"completionList:" = "Code Sense Completion List";
"completionPlaceholderSelect:" = "Code Sense Argument Placeholder Select";
"PBX_complete:" = "Complete";
"PBX_executeSelectionAppendingOutput:" = "Execute Selection Appending Output";
"PBX_executeSelectionInsertingOutput:" = "Execute Selection Inserting Output";
"PBX_executeSelectionSendingOutputToPasteboard:" = "Execute Selection Sending Output to Pasteboard";
"PBX_executeUserPipe:" = "Execute User Pipe";
"PBX_indentFriendlyDeleteBackward:" = "Indent Friendly Delete Backward";
"PBX_indentFriendlyInsertTab:" = "Indent Friendly Insert Tab";
"PBX_insertLineSeparator:" = "Insert Line Separator";
"PBX_insertNewlineAndIndent:" = "Insert Newline and Indent";
"PBX_insertNewlineAndIndentWithEnter:" = "Insert Newline and Indent With Enter";
"PBX_insertParagraphSeparatorAndIndent:" = "Insert Paragraph Separator and Indent";
"PBX_nestLeft:" = "Nest Left";
"PBX_nestRight:" = "Nest Right";
"PBX_parseFileAsPropertyList:" = "Parse File as Property List";
"PBX_parseSelectionAsPropertyList:" = "Parse Selection as Property List";
"PBX_showGotoPanel:" = "Show Goto Panel";
"PBX_toggleShowsControlCharacters:" = "Toggle Control Characters";
"addCurrentFileToProject:" = "Add Current File to Project...";
"addFiles:" = "Add Files";
"addToBookmarks:" = "Add to Bookmarks";
"alignCenter:" = "Align Center";
"alignLeft:" = "Align Left";
"alignRight:" = "Align Right";
"build:" = "Build";
"buildAndDebug:" = "Build and Debug";
"buildAndRun:" = "Build and Run";
"capitalizeWord:" = "Capitalize Word";
"centerSelectionInVisibleArea:" = "Center Selection in Visible Area";
"changeCaseOfLetter:" = "Change Case of Letter";
"changeColor:" = "Change Color";
"changeFont:" = "Change Font";
"changeSpelling:" = "Change Spelling";
"checkSpelling:" = "Check Spelling";
"cleanAllTargetsBuild:" = "Clean All Targets Build";
"cleanBuild:" = "Clean Build";
"clearConsole:" = "Clear Console";
"closeCurrentFile:" = "Close Current File";
"closeCurrentNavigator:" = "Close Current Navigator";
"closeCurrentProject:" = "Close Current Project";
"closeCurrentToolTab:" = "Close Current Tool Tab";
"copy:" = "Copy";
"copyFont:" = "Copy Font";
"copyRuler:" = "Copy Ruler";
"cut:" = "Cut";
"debug:" = "Debug Executable";
"delete:" = "Delete";
"deleteBackward:" = "Delete Backward";
"deleteForward:" = "Delete Forward";
"deleteToBeginningOfDocument:" = "Delete to Beginning of Document";
"deleteToBeginningOfLine:" = "Delete to Beginning of Line";
"deleteToBeginningOfParagraph:" = "Delete to Beginning of Paragraph";
"deleteToEndOfDocument:" = "Delete to End of Document";
"deleteToEndOfLine:" = "Delete to End of Line";
"deleteToEndOfParagraph:" = "Delete to End of Paragraph";
"deleteToMark:" = "Delete to Mark";
"deleteWordBackward:" = "Delete Word Backward";
"deleteWordForward:" = "Delete Word Forward";
"dropProjectIndex:" = "Drop Project Index";
"findNext:" = "Find Next";
"findPrevious:" = "Find Previous";
"hide:" = "Hide";
"hideOtherApplications:" = "Hide Other Applications";
"ignoreSpelling:" = "Ignore Spelling";
"indent:" = "Indent";
"indentSelection:" = "Indent Selection";
"indexProject:" = "Index Project";
"insertBacktab:" = "Insert Backtab";
"insertKillRing:" = "Insert Kill Ring";
"insertNewline:" = "Insert Newline";
"insertParagraphSeparator:" = "Insert Paragraph Separator";
"insertTab:" = "Insert Tab";
"installBuild:" = "Install Build";
"interrupt:" = "Interrupt Debugger";
"lowercaseWord:" = "Lowercase Word";
"maximizeEditor:" = "Maximize Editor";
"moveBackward:" = "Move Backward";
"moveDown:" = "Move Down";
"moveForward:" = "Move Forward";
"moveLeft:" = "Move Left";
"moveRight:" = "Move Right";
"moveToBeginningOfDocument:" = "Move to Beginning of Document";
"moveToBeginningOfLine:" = "Move to Beginning of Line";
"moveToBeginningOfParagraph:" = "Move to Beginning of Paragraph";
"moveToEndOfDocument:" = "Move to End of Document";
"moveToEndOfLine:" = "Move to End of Line";
"moveToEndOfParagraph:" = "Move to End of Paragraph";
"moveUp:" = "Move Up";
"moveWordBackward:" = "Move Word Backward";
"moveWordForward:" = "Move Word Forward";
"moveBackwardAndModifySelection:" = "Move Backward Extending Selection";
"moveDownAndModifySelection:" = "Move Down Extending Selection";
"moveForwardAndModifySelection:" = "Move Forward Extending Selection";
"moveParagraphBackwardAndModifySelection:" = "Move Paragraph Backward Extending Selection";
"moveParagraphForwardAndModifySelection:" = "Move Paragraph Forward Extending Selection";
"moveToBeginningOfDocumentAndModifySelection:" = "Move to Beginning of Document Extending Selection";
"moveToBeginningOfLineAndModifySelection:" = "Move to Beginning of Line Extending Selection";
"moveToBeginningOfParagraphAndModifySelection:" = "Move to Beginning of Paragraph Extending Selection";
"moveToEndOfDocumentAndModifySelection:" = "Move to End of Document Extending Selection";
"moveToEndOfLineAndModifySelection:" = "Move to End of Line Extending Selection";
"moveToEndOfParagraphAndModifySelection:" = "Move to End of Paragraph Extending Selection";
"moveUpAndModifySelection:" = "Move Up Extending Selection";
"moveWordBackwardAndModifySelection:" = "Move Word Backward Extending Selection";
"moveWordForwardAndModifySelection:" = "Move Word Forward Extending Selection";
"newFile:" = "New File";
"nextBookmark:" = "Next Bookmark";
"nextFindResult:" = "Next Find Result";
"openDocument:" = "Open Document";
"openInSeparateNavigator:" = "Open in Separate Navigator";
"openQuicklyAction:" = "Open Quickly";
"pageDownAndModifySelection:" = "Page Down Extending Selection";
"pageUpAndModifySelection:" = "Page Up Extending Selection";
"pageDown:" = "Page Down";
"pageUp:" = "Page Up";
"paste:" = "Paste";
"pasteFont:" = "Paste Font";
"pasteRuler:" = "Paste Ruler";
"performClose:" = "Close";
"performMiniaturize:" = "Miniaturize";
"performZoom:" = "Zoom";
"popIncludedHeadersPopUp:" = "Pop Included Headers PopUp";
"popLoadedFilesPopUp:" = "Pop Loaded Files PopUp";
"popNavigatorPopUp:" = "Pop Navigator PopUp";
"popSymbolsPopUp:" = "Pop Symbols PopUp";
"previousBookmark:" = "Previous Bookmark";
"previousFindResult:" = "Previous Find Result";
"processOpenBrace:" = "Insert Open Brace";
"printDocument:" = "Print Document";
"redo:" = "Redo";
"replace:" = "Replace";
"replaceAll:" = "Replace All";
"replaceAndFindNext:" = "Replace and Find Next";
"revealCurrentFileInGroupTree:" = "Reveal Current File in Group Tree";
"revealInBreakpointsAction:" = "Reveal in Breakpoints";
"revertDocumentToSaved:" = "Revert Document to Saved";
"run:" = "Run Executable";
"runPageLayout:" = "Run Page Layout...";
"saveAllDocuments:" = "Save All Documents...";
"saveDocument:" = "Save Document";
"saveDocumentAs:" = "Save Document As...";
"saveDocumentTo:" = "Save Document To...";
"scmCancel:" = "Cancel";
"scmCompareWithLatest:" = "Compare With Latest";
"scmCompareWithPrevious:" = "Compare With Previous";
"scmStatus:" = "Status";
"scmUpdate:" = "Update";
"scmUpdateToPrevious:" = "Update to Previous";
"scrollLineDown:" = "Scroll Line Down";
"scrollLineUp:" = "Scroll Line Up";
"scrollPageDown:" = "Scroll Page Down";
"scrollPageUp:" = "Scroll Page Up";
"scrollToBeginningOfDocument:" = "Scroll to Beginning of Document";
"scrollToEndOfDocument:" = "Scroll to End of Document";
"selectAll:" = "Select All";
"selectLine:" = "Select Line";
"selectParagraph:" = "Select Paragraph";
"selectToMark:" = "Select to Mark";
"selectWord:" = "Select Word";
"setMark:" = "Set Mark";
"showAccessingDeveloperDocumentation:" = "Show Accessing Developer Documentation";
"showCarbonBook:" = "Show Carbon Book";
"showCocoaBook:" = "Show Cocoa Book";
"showDefaultsDoc:" = "Show User Defaults Notes";
"showDeveloperCenter:" = "Show Developer Center";
"showDeveloperToolsBook:" = "Show Developer Tools Book";
"showGuessPanel:" = "Show Guess Panel...";
"showInfoPanel:" = "Show Info Panel...";
"showOldReleaseNotes:" = "Show Older Release Notes";
"showXcodeHelp:" = "Xcode Help";
"showReleaseNotes:" = "Show Release Notes";
"showBuildSettingsNotes:" = "Show Build Settings Notes";
"showSimpleFind:" = "Show Simple Find";
"splitCurrentNavigator:" = "Split Current Navigator";
"startDefinitionsFind:" = "Start Definitions Find";
"startReferencesFind:" = "Start References Find";
"startRegexFind:" = "Start Regex Find";
"startTextFind:" = "Start Text Find";
"stopBuildAndDebug:" = "Stop Build and Debug";
"stopBuildAndRun:" = "Stop Build and Run";
"stopCurrentBuild:" = "Stop Current Build";
"stopDebugSession:" = "Stop Debug Session";
"stopRunSession:" = "Stop Run Session";
"subscript:" = "Subscript";
"superscript:" = "Superscript";
"swapWithMark:" = "Swap with Mark";
"switchToSymbolicCounterpartOfCurrentFile:" = "Switch to Symbolic Counterpart";
"switchToCounterpartOfCurrentFile:" = "Switch to Counterpart of Current File";
"compileCurrentFile:" = "Compile Current File";
"preprocessCurrentFile:" = "Preprocess Current File";
"disassembleCurrentFile:" = "Disassemble Current File";
"terminate:" = "Quit";
"toggleAddBreakpointMarkerAction:" = "Toggle Add Breakpoint Marker Action";
"toggleAddToBreakpoints:" = "Toggle Add To Breakpoints";
"toggleEnableBreakpoint:" = "Toggle Enable Breakpoint"; 
"toggleBookmarksTab:" = "Toggle Bookmarks Tab";
"toggleBreakpointsTab:" = "Toggle Breakpoints Tab";
"toggleBuildTab:" = "Toggle Build Tab";
"toggleCVSTab:" = "Toggle CVS Tab";
"toggleClassesTab:" = "Toggle Classes Tab";
"toggleContinuousSpellChecking:" = "Toggle Continuous Spell Checking";
"toggleDebuggerTab:" = "Toggle Debugger Tab";
"toggleEnableBreakpointMarkerAction:" = "Toggle Enable Breakpoint Marker";
"toggleExecDebug:" = "Toggle Exec Debug";
"toggleExecRun:" = "Toggle Exec Run";
"toggleFilesTab:" = "Toggle Files Tab";
"toggleFindTab:" = "Toggle Find Tab";
"toggleGutterVisible:" = "Toggle Gutter Visible";
"toggleHorizontalTabsVisible:" = "Toggle Horizontal Tabs Visible";
"toggleNavigationBarVisible:" = "Toggle Navigation Bar";
"toggleRuler:" = "Toggle Ruler";
"toggleRunTab:" = "Toggle Run Tab";
"toggleStatusViewVisible:" = "Toggle Status View";
"toggleTargetsTab:" = "Toggle Targets Tab";
"toggleToolbarShown:" = "Toggle Toolbar";
"toggleVerticalTabsVisible:" = "Toggle Vertical Tabs";
"transpose:" = "Transpose";
"transposeWords:" = "Transpose Words";
"underline:" = "Underline";
"undo:" = "Undo";
"unhideAllApplications:" = "Unhide All Applications";
"unscript:" = "Unscript";
"uppercaseWord:" = "Uppercase Word";
"yank:" = "Yank";
"yankAndSelect:" = "Yank and Select";
*/